#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/racklabs/terraform-demo/runs/run-HgHR2NitAnYyKU4a

Waiting for the plan to start...

Terraform v0.14.9
Configuring remote state backend...
Initializing Terraform configuration...
aws_vpc.terraform-vpc: Refreshing state... [id=vpc-001defae406e8c85f]
aws_internet_gateway.gw: Refreshing state... [id=igw-02e14eba9e0d91ce1]
aws_security_group.web_nodes: Refreshing state... [id=sg-00c062cd2ad3cd1b5]
aws_subnet.public-1: Refreshing state... [id=subnet-05348ee8312456d38]
aws_route_table.rt1: Refreshing state... [id=rtb-03359ef16d1e9b372]
aws_route_table_association.association-subnet: Refreshing state... [id=rtbassoc-05db4fe0442214ace]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # vcd_vm.vcd_web_nodes[0] will be created
  + resource "vcd_vm" "vcd_web_nodes" {
      + accept_all_eulas               = true
      + catalog_name                   = "Rackspace Test Images"
      + computer_name                  = (known after apply)
      + cpu_cores                      = 1
      + cpu_hot_add_enabled            = false
      + cpus                           = 2
      + description                    = (known after apply)
      + expose_hardware_virtualization = false
      + guest_properties               = {
          + "local-hostname" = "web-01"
          + "public-keys"    = (sensitive)
        }
      + hardware_version               = (known after apply)
      + href                           = (known after apply)
      + id                             = (known after apply)
      + internal_disk                  = (known after apply)
      + memory                         = 4096
      + memory_hot_add_enabled         = false
      + metadata                       = {
          + "env"              = "staging"
          + "local-hostname"   = "web-01"
          + "public-keys-data" = (sensitive)
          + "role"             = "web"
          + "version"          = "v1"
        }
      + name                           = "web-01"
      + os_type                        = (known after apply)
      + power_on                       = true
      + prevent_update_power_off       = false
      + sizing_policy_id               = (known after apply)
      + storage_profile                = (known after apply)
      + template_name                  = "Ubuntu 20.04 Template"
      + vapp_name                      = (known after apply)
      + vm_type                        = (known after apply)

      + customization {
          + admin_password                      = (sensitive value)
          + allow_local_admin_password          = (known after apply)
          + auto_generate_password              = (known after apply)
          + change_sid                          = (known after apply)
          + enabled                             = true
          + initscript                          = (sensitive)
          + join_domain                         = (known after apply)
          + join_domain_account_ou              = (known after apply)
          + join_domain_name                    = (known after apply)
          + join_domain_password                = (sensitive value)
          + join_domain_user                    = (known after apply)
          + join_org_domain                     = (known after apply)
          + must_change_password_on_first_login = (known after apply)
          + number_of_auto_logons               = (known after apply)
        }

      + network {
          + adapter_type       = (known after apply)
          + connected          = true
          + ip                 = (known after apply)
          + ip_allocation_mode = "DHCP"
          + is_primary         = true
          + mac                = (known after apply)
          + name               = "Default2"
          + type               = "org"
        }
    }

  # vcd_vm.vcd_web_nodes[1] will be created
  + resource "vcd_vm" "vcd_web_nodes" {
      + accept_all_eulas               = true
      + catalog_name                   = "Rackspace Test Images"
      + computer_name                  = (known after apply)
      + cpu_cores                      = 1
      + cpu_hot_add_enabled            = false
      + cpus                           = 2
      + description                    = (known after apply)
      + expose_hardware_virtualization = false
      + guest_properties               = {
          + "local-hostname" = "web-02"
          + "public-keys"    = (sensitive)
        }
      + hardware_version               = (known after apply)
      + href                           = (known after apply)
      + id                             = (known after apply)
      + internal_disk                  = (known after apply)
      + memory                         = 4096
      + memory_hot_add_enabled         = false
      + metadata                       = {
          + "env"              = "staging"
          + "local-hostname"   = "web-02"
          + "public-keys-data" = (sensitive)
          + "role"             = "web"
          + "version"          = "v1"
        }
      + name                           = "web-02"
      + os_type                        = (known after apply)
      + power_on                       = true
      + prevent_update_power_off       = false
      + sizing_policy_id               = (known after apply)
      + storage_profile                = (known after apply)
      + template_name                  = "Ubuntu 20.04 Template"
      + vapp_name                      = (known after apply)
      + vm_type                        = (known after apply)

      + customization {
          + admin_password                      = (sensitive value)
          + allow_local_admin_password          = (known after apply)
          + auto_generate_password              = (known after apply)
          + change_sid                          = (known after apply)
          + enabled                             = true
          + initscript                          = (sensitive)
          + join_domain                         = (known after apply)
          + join_domain_account_ou              = (known after apply)
          + join_domain_name                    = (known after apply)
          + join_domain_password                = (sensitive value)
          + join_domain_user                    = (known after apply)
          + join_org_domain                     = (known after apply)
          + must_change_password_on_first_login = (known after apply)
          + number_of_auto_logons               = (known after apply)
        }

      + network {
          + adapter_type       = (known after apply)
          + connected          = true
          + ip                 = (known after apply)
          + ip_allocation_mode = "DHCP"
          + is_primary         = true
          + mac                = (known after apply)
          + name               = "Default2"
          + type               = "org"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>

*Pusher: @antonym, Action: `pull_request`*